[
  {
    "VersionAsString": "2.0.0.0",
    "GeneralInfo": "Our first release of the UWP version for Kliva!\r\nRebuild from the ground up with a newer design and it is now also be better aligned with the Strava API.\r\nFully Open Source up on GitHub ( https://github.com/AppCreativity/Kliva ), please log any issues there and UWP devs who would love to join are more than welcome",
    "Features": [
      "- UWP version, so it now runs on Win10 mobile, Win10 desktop and will also work with Continuum.",
      "- Added GPS tracking, enabling you to track and upload an activity directly to Strava.",
      "- Added Activity editing, some settings on your own Strava activity are now editable from within the app.",
      "- Several new Strava possibilities in reference to the Kliva Windows Phone app."
    ],
    "BugFixes": null
  },
  {
    "VersionAsString": "2.0.1.0",
    "GeneralInfo": null,
    "Features": null,
    "BugFixes": [
      "- Fixing MapServiceToken warning."
    ]
  },
  {
    "VersionAsString": "2.1.0.0",
    "GeneralInfo": null,
    "Features": [
      "- Added swipe to right on activity list to give kudos",
      "- Added swipe to left on activity list to add comment"
    ],
    "BugFixes": [
      "- Bug fix for null to System.Single conversion exception on Get Activity",
      "- Bug fix for not being able to save edited activity information"
    ]
  },
  {
    "VersionAsString": "2.1.1.0",
    "GeneralInfo": null,
    "Features": null,
    "BugFixes": [
      "- Bug fix for go to top button on Activity feed ( we hope )"
    ]
  },
  {
    "VersionAsString": "2.1.2.0",
    "GeneralInfo": null,
    "Features": null,
    "BugFixes": [
      "- Bug fix so private activities' details would again be visible"
    ]
  },
  {
    "VersionAsString": "2.1.3.0",
    "GeneralInfo": "** IMPORTANT MESSAGE **\r\nThere was a problem with the previous versions of Kliva in regards to your own tracked Strava activities, marked as private!\r\nWe fixed this in the previous release, but we've now noticed that this fix will only apply to new users.\r\n\r\nMeaning IF you see this message and had Kliva already installed, you MUST log out and log in again!\r\n\r\nOtherwise the bug will still be here and you can not see your own private activities...",
    "Features": [
      "- Being able to log out in desktop mode",
      "- What's new dialog at startup when a new version is installed"
    ],
    "BugFixes": [
      "- Bug fix for not being able to see your own private activities"
    ]
  }
]
